#include "mainwindow.h"
#include <QApplication>

/*
 *
 * -Вылетает после очищения
Определение первого поколения:
Если игра началась с него, то оно первое, до тех пор пока игра не кончится полностью

-Необходимо вынести логику в отдельный поток, тк фризится интерфейс
 Из за этого почти невозможно остановить игру

-Сменить алгоритм на обработку списка живых клеток (HashSet живых клеток)
-Инкапсулировать правила игры
-Инкапсулировать получение соседей
-Добавить кнопку на поверхности тора
*/

int main(int argc, char *argv[])
{
    QApplication a(argc, argv);
    MainWindow w;
    w.show();

    return a.exec();
}
